'''
Вие сте преподавател и трябва да сложите оценка на всеки тест.

Тъй като имате много тестове да проверявате, искате да напишете програма,
която взима крайният брой точки на един тест и казва каква трябва да бъде оценката там.

Във файл grader.py, напишете програма, която да върши работата за вас.

Правилата са следните:

Минималния брой точки е 0
Максималния брой точки е 100
Ако човек има между 0 и 50 точки включително, оценката е "Слаб 2"
Ако човек има между 51 и 60 точки включително, оценката е "Среден 3"
Ако човек има между 61 и 70 точки включително, оценката е "Добър 4"
Ако човек има между 71 и 80 точки включително, оценката е "Много Добър 5"
Ако човек има над 81 точки, оценката е "Отличен 6"
Aко човек има точно 100 точки, оценката е "Много Отличен 7"
'''

max_grade = 100
min_grade = 0
aver = 50
good = 60
better = 70
best = 80

score = input("Enter Score: ")
score = int(score)

if score == max_grade:
	print("Много Отличен 7")
elif score > best:
	print("Отличен 6")
elif score > better and score <= best:
	print("Много Добър 5")
elif score > good and score <= better:
	print("Добър 4")
elif score >= aver and score <= good:
	print("Среден 3")
else: 
	print("Слаб 2")
