'''
В REPL на Python, напишете изрази, които представляват:

Списък от числото 1
Списък от числата 1, 2 и 3
Празния списък
Списък от три булеви стойности, носещи истина
Списък от низовете "Python" и "Django"
Списък от три низа, представляващи твоите три имена
Списък от 5 низа, представляващи имена на твои близко или познати
Списък от низове, които представляват имената на всички езици за програмиране, с които си запознат/а
'''

a = [4]

b = [1, 12, 33]

c = []

d = [True, (1 + 2) == 3, True]

e = ["Python", "Django"]

f = ["Ivan", "Veselinov", "Dimitrov"]

g = ["iva", "pehondera", "stykito", "slivkata", "trudniq"]

h = ["C++", "Java", "C#", "Python"]