'''
Едно цяло число, наричаме перфектно, ако сумата на неговите делители, без самото число, е равно на самото число.

Например, числото 6 е перфектно, защото сумата на неговите делители е 6.
Друго перфеткно число е 28, което има сума на делителите: 1 + 2 + 4 + 7 + 14 = 28
Следващото перфектно число е 496.
Във файл is_perfect.py, напишете програма, която:

Чете едно число n от клавиатурата
Казва дали това число е перфектно или не.
'''

n = int(input("Enter a number: "))


count = 1
sum_of_divisors = 0

while count < n:
	if n % count == 0:
		sum_of_divisors += count
	count += 1

if sum_of_divisors == n:
	print("The number is perfect!")
else: 
	print("The number is NOT perfect! ")