'''
Иванчо, който живее в Люлин, е забелязал следното нещо: 
всички блокове в Люлин са подредени един след друг в редица

Иванчо знае височината на всеки един блок от тази редица и иска да знае, 
ако застане пред първия блок - колко блока след него ще успее да види?

Иванчо може да види само тези блокове, 
които се открояват (по-високо от предишните, които е видял).

Например, ако имаме блокове с височка 3, 1 и 5, 
то Иванчо ще види 2 блока - първият от 3 етажа и последният от 5 етажа.

Потребителят трява да въведе число, което отговаря за броя блокове в Люлински квартал.
После последователно (в списък) трябва да въведе колко ще е висок всеки блок от тях.
Във файл lyulin_city.py, напишете програма, която отпечатва на екрана колко блока ще успее да види Иванчо, 
ако застане в началото на редицата.

Например: ако имаме 5 блока по 1, 2, 5, 3, 1 етажа, Иванчо ще успее да види точно 3 блока.
Ако имаме следните блокове: [1, 5, 3, 2, 1, 8, 3, 4, 5], то Иванчо ще види точно 3 блока - първия, 
5 и 8.
'''

def luilin_city(list_of_buildings):
	count = 0
	max_num = 0

	for l in list_of_buildings:
		if max_num < l:
			max_num = l
			count += 1

	return count

#main
number_of_buildings = int(input("Enter how many buildings has in Luilin: "))
buildings_height = []

idx = 0
while idx < number_of_buildings:
	buildings_height += [int(input("Enter the height of the next building: "))]
	idx += 1

print(luilin_city(buildings_height))